#ifndef TYPEINFORMATION_H
#define TYPEINFORMATION_H

#include <stdint.h>

// Тип информации
enum class TypeInfo : int16_t
{
    INFO_0 = 0,       ///<
    INFO_94 = 94,     ///< Сообщение оператора ЦУП / КИС
    INFO_95 = 95,     ///<
    INFO_96 = 96,     ///< Файл для обмена
    INFO_97 = 97,     ///< Состав каталога
    INFO_99 = 99,     ///<
    INFO_102 = 102,   ///< Транзит СИ
    INFO_104 = 104,   ///<
    INFO_777 = 777,   ///< ИТНП (дальность) из ДЗУ
    INFO_888 = 888,   ///< ТМИ из ДЗУ
    INFO_900 = 900,   ///< Целеуказания
    INFO_902 = 902,   ///< ИТНП (углы) из ДЗУ
    INFO_1101 = 1101, ///< ТРАНЗИТ РК
    INFO_1102 = 1102, ///< ТРАНЗИТ КУ
    INFO_1602 = 1602, ///< ИФКТ
    INFO_1888 = 1888, ///< ТМИ транзит
    INFO_1889 = 1889,  ///< ТМИ (кадр 520 байт) транзит
    INFO_2001,
    INFO_2002,
    INFO_2003,
    INFO_2005,
    INFO_2006,
    INFO_2007,
    INFO_2008,
};

#endif // TYPEINFORMATION_H
